tap "hashicorp/tap"
tap "microsoft/git"
# General-purpose data compression with high compression ratio
brew "xz"
# TIFF library and utilities
brew "libtiff"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Python code formatter
brew "black"
# Object-file caching compiler wrapper
brew "ccache"
# Cross-platform make
brew "cmake"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Pack, ship and run any application as a lightweight container
brew "docker-compose"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Kubernetes package manager
brew "helm"
# Interactive computing in Python
brew "ipython"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interactive environments for writing and running code
brew "jupyterlab"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# LLVM's OpenMP runtime library
brew "libomp"
# Generic machine emulator and virtualizer
brew "qemu"
# Package manager for the Lua programming language
brew "luarocks"
# Experimental optional static type checker for Python
brew "mypy"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Optimized BLAS library
brew "openblas"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast, disk space efficient package manager
brew "pnpm"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# Python Language Server for the Language Server Protocol
brew "python-lsp-server"
# Software environment for statistical computing
brew "r"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# SMART hard drive monitoring
brew "smartmontools"
# User interface to the TELNET protocol
brew "telnet"
# Enables extra languages support for Tesseract
brew "tesseract-lang"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Terraform
brew "hashicorp/tap/terraform"
# Multi-track audio editor and recorder
cask "audacity"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Desktop password and login vault
cask "bitwarden"
# Open source IDE for exploring and testing APIs
cask "bruno"
cask "font-hack-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Free and open-source media player
cask "iina"
# Clipboard manager
cask "maccy"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Data science software focusing on R and Python
cask "rstudio"
# PDF reader and note-taking application
cask "skim"
# LaTeX and TeX editor and previewer
cask "texshop"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
